Repository: airwallex/airwallex-payment-ios
Catalog: Airwallex/AirwallexPayment/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, pt_pt, ru, th, zh_hans, zh_hant

source: Card not supported for payment
de: Karte wird für die Zahlung nicht unterstützt
es: La tarjeta no es compatible para el pago
fr: Carte non prise en charge pour le paiement
ja: お支払いにこのカードはご利用いただけません
ko: 결제에 지원되지 않는 카드입니다
pt_br: Cartão não suportado para pagamento
pt_pt: Cartão não suportado para pagamento
ru: Карта не поддерживается для оплаты
th: ไม่รองรับบัตรสำหรับการชำระเงิน
zh_hans: 该卡不支持支付
zh_hant: 此卡片不支援付款

source: Card number is invalid
de: Kartennummer ist ungültig
es: El número de tarjeta no es válido
fr: Le numéro de carte est invalide
ja: カード番号が無効です
ko: 카드 번호가 유효하지 않습니다
pt_br: Número do cartão inválido
pt_pt: Número de cartão inválido
ru: Недействительный номер карты
th: หมายเลขบัตรไม่ถูกต้อง
zh_hans: 卡号无效
zh_hant: 卡號無效

source: Card number is required
de: Kartennummer ist erforderlich
es: El número de tarjeta es obligatorio
fr: Le numéro de carte est requis
ja: カード番号は必須です
ko: 카드 번호는 필수입니다
pt_br: Número do cartão é obrigatório
pt_pt: O número do cartão é obrigatório
ru: Требуется номер карты
th: ต้องกรอกหมายเลขบัตร
zh_hans: 必须填写卡号
zh_hant: 卡號為必填

source: Card number must contain only digits
de: Kartennummer darf nur Ziffern enthalten
es: El número de tarjeta solo debe contener dígitos
fr: Le numéro de carte doit uniquement contenir des chiffres
ja: カード番号は数字のみ入力してください
ko: 카드 번호는 숫자만 포함해야 합니다
pt_br: O número do cartão deve conter apenas dígitos
pt_pt: O número do cartão deve conter apenas dígitos
ru: Номер карты должен содержать только цифры
th: หมายเลขบัตรต้องเป็นตัวเลขเท่านั้น
zh_hans: 卡号只能包含数字
zh_hant: 卡號必須僅包含數字

source: Card’s expiration date is invalid
de: Ablaufdatum der Karte ist ungültig
es: La fecha de vencimiento de la tarjeta no es válida
fr: La date d’expiration de la carte est invalide
ja: カードの有効期限が無効です
ko: 카드의 만료 날짜가 유효하지 않습니다
pt_br: A data de validade do cartão é inválida
pt_pt: Data de validade do cartão inválida
ru: Недействительный срок действия карты
th: วันหมดอายุของบัตรไม่ถูกต้อง
zh_hans: 卡片的到期日无效
zh_hant: 卡片到期日無效

source: Expiry date is required
de: Ablaufdatum ist erforderlich
es: La fecha de vencimiento es obligatoria
fr: La date d’expiration est requise
ja: 有効期限は必須です
ko: 만료 날짜는 필수입니다
pt_br: A data de validade é obrigatória
pt_pt: Data de validade é obrigatória
ru: Требуется срок действия
th: ต้องกรอกวันหมดอายุ
zh_hans: 到期日期为必填项
zh_hant: 到期日為必填

source: Invalid card number
de: Ungültige Kartennummer
es: Número de tarjeta no válido
fr: Numéro de carte invalide
ja: 無効なカード番号です
ko: 유효하지 않은 카드 번호
pt_br: Número do cartão inválido
pt_pt: Número de cartão inválido
ru: Недействительный номер карты
th: หมายเลขบัตรไม่ถูกต้อง
zh_hans: 无效的卡号
zh_hant: 卡號無效

source: Invalid CVC / CVV
de: Ungültiger CVC / CVV
es: CVC / CVV no válido
fr: CVC / CVV invalide
ja: 無効なCVC / CVVです
ko: 유효하지 않은 CVC / CVV
pt_br: CVC / CVV inválido
pt_pt: CVC / CVV inválido
ru: Недействительный CVC / CVV
th: CVC / CVV ไม่ถูกต้อง
zh_hans: 无效的CVC / CVV
zh_hant: CVC / CVV 無效

source: Invalid expires date
de: Ungültiges Ablaufdatum
es: Fecha de vencimiento no válida
fr: Date d’expiration invalide
ja: 無効な有効期限です
ko: 유효하지 않은 만료 날짜
pt_br: Data de validade inválida
pt_pt: Data de validade inválida
ru: Недействительный срок действия
th: วันหมดอายุไม่ถูกต้อง
zh_hans: 无效的到期日期
zh_hant: 到期日無效

source: Invalid name on card
de: Ungültiger Name auf der Karte
es: Nombre en la tarjeta no válido
fr: Nom sur la carte invalide
ja: カード名義が無効です
ko: 카드의 이름이 유효하지 않습니다
pt_br: Nome no cartão inválido
pt_pt: Nome no cartão inválido
ru: Неверное имя на карте
th: ชื่อบนบัตรไม่ถูกต้อง
zh_hans: 无效的持卡人姓名
zh_hant: 持卡人姓名無效

source: Please enter your card name
de: Bitte geben Sie den Namen auf der Karte ein
es: Por favor, introduce el nombre en la tarjeta
fr: Veuillez saisir le nom sur la carte
ja: カード名義を入力してください
ko: 카드의 이름을 입력하세요
pt_br: Por favor, insira o nome no cartão
pt_pt: Por favor, introduza o nome no cartão
ru: Пожалуйста, введите имя на карте
th: กรุณากรอกชื่อบนบัตร
zh_hans: 请输入卡上的姓名
zh_hant: 請輸入卡片姓名

source: Security code is invalid
de: Sicherheitscode ist ungültig
es: El código de seguridad no es válido
fr: Le code de sécurité est invalide
ja: セキュリティコードが無効です
ko: 보안 코드가 유효하지 않습니다
pt_br: Código de segurança inválido
pt_pt: Código de segurança inválido
ru: Недействительный код безопасности
th: รหัสความปลอดภัยไม่ถูกต้อง
zh_hans: 安全码无效
zh_hant: 安全碼無效

source: Security code is required
de: Sicherheitscode ist erforderlich
es: El código de seguridad es obligatorio
fr: Le code de sécurité est requis
ja: セキュリティコードは必須です
ko: 보안 코드는 필수입니다
pt_br: Código de segurança é obrigatório
pt_pt: O código de segurança é obrigatório
ru: Требуется код безопасности
th: ต้องกรอกรหัสความปลอดภัย
zh_hans: 安全码为必填项
zh_hant: 安全碼為必填

source: Security code must contain only digits
de: Sicherheitscode darf nur Ziffern enthalten
es: El código de seguridad solo debe contener dígitos
fr: Le code de sécurité doit uniquement contenir des chiffres
ja: セキュリティコードは数字のみ入力してください
ko: 보안 코드는 숫자만 포함해야 합니다
pt_br: O código de segurança deve conter apenas dígitos
pt_pt: O código de segurança deve conter apenas dígitos
ru: Код безопасности должен содержать только цифры
th: รหัสความปลอดภัยต้องเป็นตัวเลขเท่านั้น
zh_hans: 安全码只能包含数字
zh_hant: 安全碼必須僅包含數字
